import { Interview } from '../types';

export const INTERVIEWS: Interview[] = [
    {
        id: '1',
        question: 'Q. 프론트엔드를 선택한 이유?',
        answer: '**사용자 경험의 출발점을 설계**할 수 있다는 점에서 프론트엔드 개발자에 매력을 느꼈습니다.<br />아무리 유용한 서비스라도 UI/UX가 불편하 사용자는 **쉽게 이탈**합니다.<br />프론트엔드는 서비스의 **첫인상을 책임**지며, 사용자와 가장 가까운 거리에서 **상호작용을 설계**하고, 피드백을 바탕으로 사용자 중심의 경험을 지속적으로 개선해 나가는 역할이라는 점에서 매력을 느꼈습니다.<br />실제로 팀 프로젝트에서 채팅방 UI가 가독성이 떨어진다는 피드백을 받고 전면적으로 개선한 적이 있었는데, 이후 사용자 반응이 크게 좋아졌고, UI 개선이 **사용자 만족도에 미치는 영향**을 직접 느꼈습니다.',
    },
    {
        id: '2',
        question: 'Q. 개발자로서의 본인의 강점은?',
        answer: '문제의 **본질을 파악**하고 끝까지 **해결**하려는 **책임감** 있는 태도가 저의 가장 큰 강점입니다.<br />일상 속 작은 문제를 마주할 때도 단순한 임시방편보다 **근본적인 원인**을 분석하고, 다양한 해결책을 비교해 **최선의 방안**을 찾는 습관이 있습니다.<br />이러한 태도는 개발 과정에서도 이어졌고, 실제로 팀 프로젝트에서는 디버깅을 주도하며 핵심 이슈 해결에 기여한 경험이 있습니다. 단순한 증상 해결에 그치지 않고, **문제의 구조를 파악**하고 개선 방향까지 설계하려는 접근 방식이 강점으로 작용했습니다.',
    },
    {
        id: '3',
        question: 'Q. 협업 시 가장 중요하게 생각하는 것은?',
        answer: '협업에서 가장 중요하다고 생각하는 것은 **두괄식 의사소통**과 **명확한 문서화**입니다.<br />의사소통 또한 시간과 에너지가 소모되는 **비용**이며, 팀 내 갈등의 대부분은 서로의 **의도가 제대로 전달되지 않아** 발생한다고 생각합니다.<br />그래서 저는 핵심을 먼저 전달하는 두괄식 표현을 통해 **오해를 줄이**고, 중복된 설명이나 질문을 줄여주는 **문서화를 병행**함으로써 팀 전체의 커뮤니케이션 효율을 높이고자 노력합니다.<br />특히 팀 프로젝트에서는 정리된 문서가 비동기 협업에서 큰 역할을 했고, 두괄식 표현은 회의 시간 단축에도 효과적이었습니다.',
    },
];
