import { Interview } from '../types';

export const INTERVIEWS: Interview[] = [
    {
        id: '1',
        question: 'Q. 프론트엔드를 선택한 이유?',
        answer: '아무리 맛있는 음식점이라도 간판이나 입구가 눈에 띄지 않으면 손님이 들어가지 않듯, 아무리 유용한 서비스라도 복잡하고 난해한 UI/UX로 인해 사용자가 이탈한다면 그 가치를 전달할 수 없습니다. <br/> 이 점에서 프론트엔드는 **서비스의 첫인상을 책임**지고, **사용자 경험의 핵심을 설계**하는 매력적인 포지션이라고 느꼈습니다. <br /> 사용자와의 상호작용을 가장 가까운 거리에서 설계하고 개선할 수 있는 역할에 매력을 느껴 프론트엔드 개발자를 선택하게 되었습니다.',
    },
    {
        id: '2',
        question: 'Q. 개발자로서의 본인의 강점은?',
        answer: '저의 강점은 **침착함과 끈기 있는 책임감**으로 문제를 끝까지 해결해나가는 태도입니다. <br /> 문제가 발생했을 때 단순히 증상을 해결하는 것이 아니라, 문제의 **본질을 파악**하고 다양한 해결 방안을 도출한 뒤, 각각의 장단점을 분석해 최선의 방안을 선택하려고 노력합니다. <br /> 이러한 문제 해결 방식 덕분에 팀 프로젝트에서는 **디버깅을 주도적으로 담당**하며 핵심 이슈 해결에 기여할 수 있었습니다.',
    },
    {
        id: '3',
        question: 'Q. 협업 시 가장 중요하게 생각하는 것은?',
        answer: '저는 **두괄식 의사소통**과 **문서화**를 가장 중요하게 생각합니다. <br />의사소통 또한 일종의 비용이며, 그 과정에서 발생하는 갈등의 대부분은 서로의 의도가 명확히 전달되지 않아 생기는 **오해**에서 비롯된다고 생각합니다.<br /> 그래서 저는 핵심을 먼저 전달하는 두괄식 표현과, 불필요한 상호작용을 줄여주는 명확한 문서화가 팀 전체의 커뮤니케이션 효율을 높이는 데 핵심적인 역할을 한다고 믿습니다.',
    },
];
